<!DOCTYPE html>
<html>
<head>
    <title>Practica 17 Act 2</title>
    <meta charset="UTF-8">
    <meta name="description" content="" />
    <meta name="keywords" content="" />
    <link rel="icon" href="Emey87-Social-Button-Rss.ico" />
</head>
<body>
    <h1>Practica 17 - RSS</h1>
    <h2>Ejercicio 2. Estructura de los canales de contenidos</h2>
    <ol>
    <h3><li>Indica para qué se usan los siguientes elementos hijos del elemento <channel> en un documento RSS: </li></h3>
        <xmp><category></xmp>
            <p>Hace posible que los agregadores RSS agrupen sitios según la categoría.</p>
        <xmp><copyright></xmp>
            <p>Notifica sobre material protegido por derechos de autor.</p> 
        <xmp><image></xmp> 
            <p>Permite que se muestre una imagen cuando los agregadores presentan un feed. </p>
        <xmp><language></xmp>
            <p>Se usa para especificar el idioma utilizado para escribir su documento.</p>
        
        <h3><li>Indica para qué se usan los siguientes elementos hijos del elemento <item> en un documento RSS: </li></h3>
            <xmp><author></xmp>
                <p>Se usa para especificar la dirección de correo electrónico del autor de un artículo.</p>
            <xmp><comments></xmp>
                <p>permite que un elemento se vincule con comentarios sobre ese elemento.</p>
            <xmp><enclosure></xmp>
                <p>permite que se incluya un archivo multimedia con un elemento.</p>
                
<h3><li>Básate en los recursos localizados en el ejercicio 1 para hacer las siguientes tareas (copiando y pegando la línea que se encuentra en el código fuente del recurso RSS):</li></h3>
    <ol><li>Cita el título del canal y la descripción del periódico.</li>
        <xmp> <title><![CDATA[La Provincia - Fuerteventura]]></title> </xmp>
        <xmp> <description><![CDATA[La Provincia - Fuerteventura]]></description> </xmp>
        
        <li>Cita el idioma empleado y la información de Copyright de la emisora de tv.</li>
        <p>El idioma no lo tiene citado.</p>
        <p>La informacion de Copyright no lo tiene citado.</p>
        
        <li>Cita el título y el link de la segunda noticia del periódico.</li>
        <xmp><title><![CDATA[La patronal apuesta por el consumo de productos canarios en los hoteles]]></title></xmp>
        <xmp><link><![CDATA[http://www.laprovincia.es/fuerteventura/2017/12/08/patronal-apuesta-consumo-productos-canarios/1006117.html?utm_source=rss]]></link> </xmp>
                
        <li>Cita la fecha de publicación del primer ítem del canal de TV.</li>
        <xmp><pubDate>Fri, 08 Dec 2017 00:11:36 GMT</pubDate></xmp>
                
        <li>Cita el título del tercer ítem de la revista.</li>
        <xmp><title>David Bisbal está hecho un manitas: tarde de manualidades navideñas con su hija Ella</title></xmp>
                
        <li>Cita el link del primer ítem del portal gubernamental.</li>
                <xmp><title>Sumario</title></xmp>
        <li>Cita la descripción del primer ítem del portal de la revista.</li>
                <xmp><description><![CDATA[<p>Que <strong>este a&ntilde;o no ha parado de sorprender a Paula Echevarr&iacute;a </strong>lo volvemos a constatar al verla en la &uacute;ltima imagen en la que aparece. Mientras su vida personal atraviesa su momento m&aacute;s delicado desde hace casi un a&ntilde;o, <strong>la actriz compensa los malos momentos</strong> con una agenda profesional que da envidia, disfrutando del tiempo de su hija, volviendo al cine y marc&aacute;ndose fiestas antol&oacute;gicas.</p><p>Su cumplea&ntilde;os lo celebr&oacute; por todo lo alto, en Halloween se desmelen&oacute; y este puente de la Constituci&oacute;n la hemos vuelto a ver d&aacute;ndolo y no en las pistas de esqu&iacute;. Porque <strong>en la estaci&oacute;n catalana de Baqueira-Beret no todo son los deportes de nieve.</strong> Por la noche todo se transforma abriendo unas botellas de champ&aacute;n y, <strong>al final te ves de fiesta con el propio Pikachu, con &#39;recuerdo&#39; fotogr&aacute;fico de la noche. </strong>Esa clase de documento gr&aacute;fico que, en el momento de m&aacute;xima intensidad de la fiesta, te parece la mejor idea, pero al d&iacute;a siguiente reconoces que te precipitaste un poquito. Pero, de perdidos al r&iacute;o, que hay muchos motivos para brindar y celebrar ahora que la Navidad est&aacute; a la vuelta de la esquina. Y no nos puede gustar m&aacute;s que as&iacute; sea.</p><p><!--mgrr:30080--></p><p>&iquest;Qui&eacute;n le iba a decir a la int&eacute;rprete de &#39;Velvet&#39; que iba a acabar de fiesta y de charla animada con el mism&iacute;simo Pikachu? Y no cualquier Pikachu, sino uno de los m&aacute;s estilosos del panorama nacional. <strong>Paula ha pasado un rato inmejorable junto al m&uacute;sico y empresario Aldo Comas. El marido de Macarena G&oacute;mez </strong>ha compartido una divertida imagen en la que aparece sin camisa y con un tronchante gorro del popular pok&eacute;mon amarillo. Aldo le dedica un brindis al objetivo, cogiendo de los hombros a Paula, cuyo gesto de circunstancias no puede ser m&aacute;s c&oacute;mico.</p><p><strong>Echevarr&iacute;a est&aacute; disfrutando del tiempo libre</strong> despu&eacute;s de que recientemente finalizara su participaci&oacute;n en el rodaje de su nueva pel&iacute;cula, &#39;Ola de cr&iacute;menes&#39;. Hace unos d&iacute;as la ve&iacute;amos pasando <strong>un puente de chicas en Madrid junto a su hija Daniella</strong> y ahora, &iquest;qu&eacute; mejor que acabar este merecido descanso junto a personas tan divertidas y c&aacute;lidas como Aldo Comas?</p>]]></description></xmp>
                </ol>
</ol>
</body>
</html>